Repository: henyee/NBDYSJCT
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: “当然，当你用完这个酒窖里的酒时，希望你已经能够将你酿的泰坦酒装桶再次放入酒窖之中。”麦格看着有点出神的埃菲说道。
en_us: "Of course, I hope you could already fill this cellar with the Titan Liquor that you brewed after the Titan Liquor in this cellar is finished." Mag said to Eiffie, who was a little out of sorts.

source: “当真？！”酒馆老板一惊，看着小二问道。
en_us: The tavern's boss was taken aback and asked the waiter again, "Are you sure?!"

source: “当诺兰大陆各族放下成见，决定先联手对付魔鬼时，他需要的是实力足够强大，数量足够充足的帮手。”麦格看着下方密密麻麻的尸坑，神情有些复杂道：“这些尸体将组成一支强大的亡灵军队，随他征战诺兰大陆。”
en_us: "When all the races on the Norland Continent decided to put aside the differences and join forces to deal with the devil, Josh will need to have stronger power and more helpers." Mag looked at the densely packed corpses' pits below and said with a complicated expression, "These corpses will a mighty undead army and follow him around to conquer the Norland Continent."

source: “很奇特的是，我在这里面闻到了酒香，他们竟然用酒来烹饪食物。”
en_us: "The unique thing is, I smelled alcohol's aroma in it. They actually used alochol to cook."

source: “很好，我喜欢。不过，我们要怎么做？”
en_us: "It's great. I like it. But, what do we do?"

source: “很好，继续保持！”
en_us: "Excellent, maintain this!"

source: “很好，这么多年了，终于给老子玩出了一点不一样的花样，我倒要看看，你究竟想要什么。”御书房的门缓缓关闭，安德烈的脸上却露出了一丝意味难明的冷笑。
en_us: "Very well. After so many years, you're finally coming up with something different. I do want to see what exactly you want to do." The door to the Royal Study closed slowly, and Andre sneered.

source: “很少有人这样称赞我。”麦格由衷道。
en_us: "Very few people praise me like that," Mag said sincerely.

source: “很抱歉，对面就有一个。”埃菲在心里叹了口气，她可不就已经被拒绝了一次了吗。
en_us: I'm sorry. There's one right opposite. Eiffie sighed inwardly. Hadn't she been rejected more than once?

source: “得到了一个什么？”麦格笑着问道。
en_us: "What did you receive?" Mag asked smilingly.

source: “微臣……也不知乔修殿下现在身在何处。”理查德声音有些颤抖。
en_us: "I… have no idea where Prince Josh is right now." Richard's voice quivered.

source: “德克·布鲁斯特，艾略特手下第一管家，命令的绝对执行者，染着许多精灵鲜血的刽子手，今日我宣判你死罪，当场诛杀。”没等德克再说什么，伊琳娜拿出了一个黑色的本子，大声宣布道。
en_us: Before Dirk could say anything else, Irina took out a little black notebook and loudly declared, "Dirk Brewster. The number one butler under Elliot. The absolute executor of his orders. The executioner tainted with the blood of many elves. Today, I declared the death sentence on you. You will be killed right on the spot."

source: “忘了定闹钟吗？”麦格侧头看了一眼床头的闹钟，没想到已经是早上九点钟，不禁惊讶道：“这么晚了？！”
en_us: "Did I forget to set the alarm clock?" Mag turned to look at the alarm clock on the bedside table. He didn't expect that it was already nine in the morning. He couldn't help exclaiming, "It's already so late?!"

source: “怎……怎么会呢，我一定会拼尽全力守护森林，一步也不敢后退。”艾略特的额头上全是冷汗，低着脑袋不敢看海伦娜。
en_us: "H-how is that possible? I would've done my best to protect the forest, and would've never taken a step back." Elliot's forehead was filled with perspiration, and he lowered his head, afraid to look at Helena.

source: “怎么了，有什么事吗？”麦格微笑着起身问道。
en_us: Mag got up and smilingly asked, "What's up? What's the matter?"

source: “怎么了？发生了什么事吗？”餐厅中金光一闪，刚刚回到餐厅的伊琳娜看着面色有些沉重的麦格问道。
en_us: A golden light flashed in the restaurant, and Irina, who just returned, looked at Mag's grave expression, and asked, "What's the matter? Did something happen?"

source: “怎么会有如此多珍贵的食材！”系统有些惊了。
en_us: "Why are there so many rare ingredients!" The System was stunned.

source: “怎么会这样！快来人！有刺客！抓刺客啊！”
en_us: 'What happened!? Help! There's an assassin! Catch the assassin!"

source: “怎么会，孩子们喜欢就好。”
en_us: "It's fine as long as the children like it."

source: “怎么可以这么好吃！”
en_us: How can it be so good?!

source: “怎么可以这么难吃！”
en_us: "How can it taste so horrible!"

source: “怎么可能，小朋友是不能喝酒的。”麦格连忙摆手。
en_us: "How's that possible? Children can't drink." Mag quickly waved his hands.

source: “怎么样，好吃吗？”艾米满是期待的问道。
en_us: "How is it? Is it tasty?" Amy asked with a hopeful look on her face.

source: “怎么样？”亚伯罕笑着道。
en_us: "Try it, it tastes rather similar," Abraham said with a smile.

source: “怎么样？”麦格看着梅兰特问道。
en_us: "How is it?" Mag asked.

source: “怎么样？冰镇过的绿豆糕，味道如何？”麦格笑着问道。
en_us: "How is it? How's the taste of the chilled mung bean pastry?" Mag asked with a smile.

source: “怎么还是一点创意都没有……”麦格看着那一个个围着不少人的游戏摊位，嘴上虽然嫌弃，却有了几分熟悉的感觉。
en_us: "Why aren't there any new innovations…" Mag looked at all the crowded game stalls, and even though he sounded disdainful, he felt a sense of familiarity.

source: “怎么这么高兴？”弗格斯笑问。
en_us: Fergus smilingly asked, "Why are you so happy?"

source: “怎么，女王也会害羞吗？”麦格上前半步，两人的身体几乎贴在一起，带着几分调笑道。
en_us: Mag took half a step forward and their bodies almost touched each other as he teasingly said, "Why? Does a queen feel shy too?"

source: “怎么，老夫老妻的，晚上没有点什么事还不能来找你了？”伊琳娜笑吟吟的问道，侧身的时候，轻薄的纱裙向下滑了一点。
en_us: "Why? We're husband and wife. Can't I come look for you at night even if I don't have any issues?" Irina asked with a smile. Her thin gauze dress slided down a little when she leaned to her side.

source: “怎么，还有点舍不得？”伊琳娜似笑非笑的看着麦格。
en_us: "Why, miss her?" Irina looked at Mag with a seeming smile.

source: “怎么？想吃宵夜了吗？”麦格笑着说道，他本以为他们已经睡着了。
en_us: "Why? Do you want to eat supper?" Mag asked with a smile. He thought they had gone to sleep.

source: “怎样？”麦格用筷子尝了一下自己的蘸碟，满意的点了点头。
en_us: "Like what?" Mag dipped his chopsticks in the dipping sauce and tried it. He nodded with satisfaction.

source: “怕了？”
en_us: "Afraid?"

source: “总编！混乱之城的经销商要求我们加印十万册！”一位编辑兴冲冲的闯进加兰的办公室，声音都有些发颤道。
en_us: "Chief! Chaos City's distributor requested for another 100,000 prints!" an editor rushed into Garlan's office as he said with a shaky voice.

source: “恐怖猎手，你违反了地下世界第一守则，违规来到诺兰大陆，现在将你的灵魂缉拿归案，将送回地下城进行审判！”晞冷漠的宣判，然后将水晶球收起。
en_us: "Horror Hunter, you have violated the first rule of Underground City. You came to the Norland Continent against the rules. I'm now arresting your soul and sending it back to the Underground City for judgement!" Xi declared coldly before keeping the crystal ball away.

source: “恭喜。”
en_us: "Congratulations."

source: “恭喜宿主创造出第一道无菜谱美食，获得新成就：凭空想象复制者！”
en_us: "Congratulations to the Host for creating your first dish without a recipe. You unlocked a new achievement: Imaginary Replicator!

source: “恭喜宿主获得奖励：面食经验包！”
en_us: "Congratulations on receiving the reward: cooked wheaten foods' experience bag!

source: “恭喜宿主获得物品：神秘擀面杖一根。”
en_us: "Congratulations on receiving an item: one mysterious rolling pin."

source: “恭喜宿主获得能力：精神控制！”
en_us: "Congratulations on receiving the power: mind control!

source: “恭喜宿主，踏出餐厅扩张第一步！”
en_us: "Congratulations for taking the first step to expand the restaurant, Host!"

source: “恭喜小主完成新手任务，获得新手礼包一份，请注意查收！”
en_us: "Congratulations on completing the novice assignment, Little Mistress. You have received one novice's gift package. Please accept your gifts!"

source: “恭喜小主完成购买早餐任务！获得一次大转盘机会！请小主自行前往领取。”系统的声音在艾米的脑海中响起。
en_us: "Congratulations on completing your breakfast-buying mission! You have won a chance to spin the big wheel! Please proceed to claim your prize," the System's voice rang in Amy's head.

source: “恭喜泰坦酒馆和塞班酒馆，现在有请两位酒馆老板上台领取金奖奖杯。”主持人说道。
en_us: "Congratulations to both Titan Tavern and Saipan Tavern. Could the owners please come up to the stage to receive your gold award's trophy." The emcee announced.

source: “恭喜老板的茅台酒大获成功，不过恕在下孤陋寡闻，还不知道塞班酒馆开在哪里，也想过两日亲自去品尝一下这美酒。”麦德勋也不气馁，继续笑呵呵道。
en_us: Madison wasn't discouraged and continued to laughingly say, "Congratulations to Boss for the success of your Maotai. However, please forgive me for my ignorance. I don't know where is Saipan Tavern located? I would like to go and try this exquisite liquor personally two days later."

source: “恭喜获得‘笑话大王’一本，获得‘属性鉴定’技能。”
en_us: "Congratulations on receiving a copy of 'The King of Jokes.' You have received the ability of 'Attribute Identification.'"

source: “恭喜鲍里斯先生，看来今年金奖有望啊。”
en_us: "Congratulations, Mr. Boris. Looks like you have a high chance of winning this year."

source: “恭喜，哈迪斯先生的茅台果然不同凡响。”埃菲侧头看着麦格，笑容真挚的说道。
en_us: Eiffie turned to Mag and said with a sincere smile, "Congratulations. Mr. Hades' Maotai is indeed exceptional."

source: “恭喜，相信你父亲知道这个消息，也会感到欣慰的。”麦格看着她轻声说道。
en_us: "Congratulations. I believe your father would be glad to knwo this," Mag told her gently.

source: “悟了悟了。”麦格点点头，小粉丝嘛，挺好的。
en_us: "I got it. I got it." Mag nodded. She was his fan. That was nice.

source: “您吃的满意吗？”卡诺有点紧张的看着希利问道。
en_us: "Are you satisfied with your dinner?" Canault asked Seely nervously.

source: “您好，认识一下，我是卡莎酒馆的老板麦德勋。”隔壁的胖子老板满脸堆笑的和麦格说道。
en_us: "Hello. Let's get to know each other. I'm the boss of Casa Tavern, Madison." The fatty boss sitting next to Mag said to him smilingy.

source: “您好，请问您是？”工作人员上前，有些警惕的看着麦格问道，目光打量了一会他身边的烤箱和大箱子。
en_us: "Hello, may I ask who you are?" a staff member who came up asked Mag warily, sizing up the grills and the big crate next to him.

source: “您尝尝，这些都是麦米餐厅非常受欢迎的菜。”卡诺满是尊敬的看着希利，作为一名教廷的边缘人士，能够与大主教同桌共进晚餐的机会可不多。
en_us: "Please try them. They are very popular dishes in Mamy Restaurant." Canault looked at Seely respectfully. As part of the marginalized personnel of the Holy See, he usually didn't have many chances to dine together with an archbishop.

source: “您应该考虑的是一会喝醉了要怎么回去呢。”艾米微笑着说道。
en_us: "What you should consider is how to return home after you get drunk later." Amy replied with a smile.

source: “您是说她是伪装的？”诺亚想了想，又是有些恍然道：“也对哦，麦老板是亚历克斯大人，那他的夫人，也只能是伊琳娜公主了。”
en_us: "You mean she was in disguise?" Noah thought for a while. After that, he had an epiphany, and said, "That's true. Boss Mag is Master Alex, so his wife must be Princess Irina.

source: “您老就消消气吧，昨天那奥尔登可是前车之鉴，这老板不好惹。”同来的官员笑着道。
en_us: "Calm down. What happened to Aulden yesterday is a warning. The owner here isn't to be trifled with," an official who came over with him said with a smile.

source: “您觉得不是兽人族做的吗？”迪克斯有点意外迈克尔的反应，这件事最有动机和行动力去做的，应该就是兽人族才对，而奥斯特也是自己承认了这一点。
en_us: "You don't think that the orcs have done it?" Dicus was surprised with Michael's reaction. The orcs had the most motivation and ability to do this, and Auster had admitted to it himself.

source: “您请。”波比双手捧着酒杯轻轻放在了卢西恩的面前。
en_us: "Please." Bobby placed the glass gently in front of Lucien with both hands.

source: “您请自便。”埃菲微笑道。
en_us: "Do as you please," Eiffie said witha smile.

source: “情况虽然有些复杂，不过这个傻大个为了感谢我制止了他的自残冲动，还是透露了一些信息。”
en_us: "The situation might be a little complicated but this giant fool even revealed some information to me to thank me for stopping his self-mutilation."

source: “想不通……想不通……”一旁梅兰特也是刚好放下勺子，一脸不解。
en_us: "Don't understand… Don't understand…" Merante, who had also just placed his spoon down, was puzzled.

source: “想学啊？”麦格笑了。
en_us: "You want to learn it?" Mag smiled.

source: “想跑？”艾米一巴掌把它按住。
en_us: "Trying to escape?" Amy pressed it down with her palm.

source: “惹不起，咱们就喝酒嘛，听说这里的酒还真不错。”那老大人也不纠结，笑着道。
en_us: "Not to be trifled with. We're just here for the drinks. I heard that the wine here is really good," the old courtier said with a smile.

source: “愚昧，无知。”希利沉闷的憋出了两个词。
en_us: "Foolish. Ignorant." Seely blurted out two words solemnly.

source: “感谢您的救命之恩，和这段时间的款待。”梅兰特端起酒杯，一脸郑重的看着麦格说道。
en_us: Merante picked up his glass, and solemnly said to Mag, "Thank you for saving us and for your hospitality."

source: “慢走，不送。”麦格将最后一位醉醺醺的客人搀出酒馆，交给他的车夫，顺手关上了酒馆大门。
en_us: "Goodbye, I will not see you off." Mag helped the last drunk customer out of the tavern, handed him over to his coachman, and closed the door of the tavern behind him.

source: “懂，就是兄弟比老婆重要嘛，天天下班就和兄弟去喝酒。”伊琳娜翻了个白眼，斜眼看着麦格，带着几分杀气道：“你要是敢这样，我不介意丧偶。”
en_us: "Got it. Brothers are more important than your wives. The most important thing after work is to go drinking with your brothers." Irina rolled her eyes. She glanced at Mag, and said murderously, "If you dare to do that, I don't mind being a widow."

source: “成了！”埃菲的脸上露出了喜色。
en_us: "Success!" Eiffie was elated.

source: “成了！哈哈哈！”
en_us: "It's working! Hahaha!"

source: “成功了！小姐成功了！”刚刚走进酿酒坊的玛拉也是惊喜道。
en_us: "It's a success! Young Mistress, it's a success!" Mala, who just walked into the brewery, exclaimed.

source: “成功把你卖给哈迪斯了。”埃菲撇嘴。
en_us: "I have successfully sold you to Hades." Eiffie pursed her lips.

source: “我……”简犹豫了一会，还是没有说话。
en_us: "I…" Jane hesitated for a moment, but she didn't say anything in the end.

source: “我……”诺亚一时间竟是无言以对。
en_us: "I…" Noah was actually lost for words at that moment.

source: “我……”诺亚张了张嘴，露出了一脸苦涩的笑容，听听，这说的是人话吗？
en_us: "I…" Noah opened his mouth, and revealed a bitter smile. Listen to that. Is he for real?

source: “我……”那精灵一愣，表情有点害怕。
en_us: "I..." That elf was taken aback with a terrified expression.

source: “我……”那精灵面色一变，不过很快又道：“可他们往南边去了，要追的话，不是应该往南边去吗？”
en_us: "Me..." That elf went white, but he quickly asked, "But they have gone southwards. Shouldn't we go to the south if we want to pursue them?"

source: “我……小姐我先去买菜了。”玛拉转身就走。
en_us: "I... Young Mistress, I am going to buy some groceries." Mala turned to leave.

source: “我……就是随便问问。”
en_us: "I… am just asking casually."

source: “我……我……”小丫鬟认真思考了一会，“要是那老板要的话，奴婢还是愿意牺牲一下的。”
en_us: "I-I…" The little maid thought seriously for a moment. "If that boss wants me, I'm willing to sacrifice myself."

source: “我……我也来点？”诺亚小声道，伸手想去拿酒瓶。
en_us: "C-can I have some too?" Noah said softly as he reached out for the bottle.

source: “我……我们……要不要……再来两瓶？”库尔特一手撑着桌子，眯着眼睛看着对面问道。
en_us: Kurt pressed one hand against the table and said with narrowed eyes, "Sh-shall we or-order another two bottles?"

source: “我……我没事……”梅兰特伸手按住了诺亚的手，气息有些不足道。
en_us: Merante reached out to hold Noya's hand as he said breathlessly, "I… I'm fine…"

source: “我……我给你们做早餐啊。”艾米回头看着麦格，挂着两道黑色炭迹的脸上，露出了干净的笑容，眼睛弯弯的，煞是可爱。
en_us: "I-I am making breakfast for you guys." Amy turned around to look at Mag. She had two black charcoal traces on her face as she revealed a pure smile with crescent eyes. She looked superbly adorable.

source: “我……我还在学习。”埃菲强调道。
en_us: "I... I'm still learning," Eiffie emphasised.

source: “我……我那不是迷路，只是偶偶找不着北而已……师父你看，今天的月亮好圆啊，不知道芭芭拉有没有回月亮啊，再让她给我带点月亮石好了。”
en_us: "I...I'm not lost. I just occasionally couldn't find my way...Look, Master. The moon is so bright tonight. I wonder did Babla go back to the moon. It'll be great if she can bring back some more moon stones to me."

source: “我……明明……明明放了火的。”麦格啐了一口唾沫。
en_us: "I... did... did light them on fire." Mag spat.

source: “我……没……”鲍里斯想哭了。
en_us: "I...didn't..." Boris felt like crying.

source: “我一直觉得你像你的母亲，就连做萝卜条的手艺都得到了传承，非常好吃，是当初的味道。”帕萨卡放下筷子，向埃菲竖起了大拇指。
en_us: "I always feel that you resemble your mother. You even inherited her skills at making the preserved radish strips. It's very delicious and taste just like before." Pasaca put down his chopsticks and gave Eiffie a thumbs up.

source: “我下次会离他远一点的。”麦格点点头。
en_us: "I will stay away from him in the future." Mag nodded.

source: “我不同意！洛斯帝国杀了我们那么多族人，屠戮了我们那么多部落，我们要是加入和平联盟，难道就不为他们报仇了吗？这样的奇耻大辱，你们咽的下去，我咽不下去！”
en_us: "I refuse! The Roth Empire has killed so many of our people, and massacred so many of our tribes. If we were to join the Peace Alliance, are we not taking revenge for them anymore? I won't be able to take such humiliation lying down even if you can!"

source: “我不女装。”麦格连忙摆手。
en_us: "I don't crossdress." Mag quickly waved his hands.

source: “我不怕累，我就是喜欢跟您做事，有牌面。”诺亚嘿嘿一笑，以后说出去也是倍有面子的事情啊。
en_us: "I'm not afraid of tiredness. I like to work with you. I feel proud." Noah chuckled. It would be a very proud affair to tell people in the future.

source: “我不是商人，我是一个厨师，只是偶偶会投资一点被严重低估的产业。”麦格一脸坦然道。
en_us: "I am not a businessman. I am a chef. I just invest in some assets that had been heavily underrated." Mag said.

source: “我不知道。”麦格也放下了剑，“但我应该知道一些你所不知道的消息。”
en_us: "I don't know." Mag also put down his sword, "but I should know some information that you don't know."

source: “我不要。”诺亚欲哭无泪的拒绝。
en_us: "I don't want it." Noah rejected it with exasperation.

source: “我之前听闻品酒大会只设一个金奖。”麦格微微点头，然后转身向着厨房走去。
en_us: "I heard that the liquor tasting event only has one gold award." Mag nodded slightly before walking to the kitchen.

source: “我之前得到了一个面具，带上之后可以模仿任何人的样子。”麦格解释道。
en_us: "I got my hands on a mask previously. After wearing it, I can change my face to become anyone," Mag explained.

source: “我也去！我也去！”艾米连忙举起小手，积极参与。
en_us: "I'm going too! I'm going too!" Amy quickly put up her hand and took part with enthusiasm.

source: “我也听到了，而且我还听到利尔大人叫了一声乔修殿下。”
en_us: "I did too. On top of that, I even heard Lord Lear call him Prince Josh."

source: “我也很开心。”麦格同样笑着说道。
en_us: "I'm happy too," Mag said, likewise with a smile.

source: “我也得好好补补。”麦格深以为然的点头。
en_us: "I deserved some nourishment too." Mag nodded in agreement.

source: “我也是10分！泰坦酒和马库斯值得。”弗格斯拿起了号牌。
en_us: "10 points from me too! Titan Liquor and Marcus are worth it." Fergus lifted his sign.

source: “我也是听说的，他肯定是带着酒来的，一会酒上了桌，自然就知道了。”
en_us: "I heard about it too. He must have came with his liquors. We'll naturally know when the liquors are served later."

source: “我也是昨晚偶然转到那里，闻到酒香才进了那家酒馆，的确是难得一见的美酒。”波比说道。
en_us: "I also went there by chance last night, and entered the tavern because of the fragrance of the wine. It was indeed a good wine that is hard to come by," Bobby said.

source: “我也是这样想的。”麦格欣赏的看着伊琳娜，不愧是他老婆，这都能和他想到一块去。
en_us: "That's what I think too." Mag looked at Irina. She's his wife indeed. They even had the same ideas.

source: “我也相信会是这样的。”麦格把那一大叠房契整理好，放入一旁的箱子里。
en_us: "I believe so too." Mag tidied up that big stack of title deeds, and placed them in the box at the side.

source: “我也要试试。”艾米凑上前，张嘴在灌汤包上咬了一个小口，然后把嘴巴贴上去，小口小口的吸溜着汤汁。
en_us: "I want to give it a try too." Amy went up and bit into the soup dumpling. After that, she put her mouth to the dumpling and took small sips of the soup.

source: “我也赞同，兽人族内部分裂成两派，现在和平派实力比我们更强了，只凭我们，恐怕连矮人族和地精族都打不过，拿什么和洛斯帝国打？”很快便有一位酋长出来附和道。
en_us: "I agree too. The orcs are currently split into two groups. The pro-peace group is stronger than us now. We might not be able to defeat the dwarves and goblins. What do we have to fight with the Roth Empire?" another chief quickly chimed in.

source: “我今天早上已经把图纸给了三位老铁匠，三天内应该就能出成品，到时候还要劳烦哈迪斯先生帮忙组装呢。”埃菲看着麦格说道。
en_us: Eiffie said to Mag, "I have passed the blueprint to three old blacksmiths this morning. The end products should be ready in three days time. I will have to bother Mr. Hades to help me assemble them then."

source: “我今日不喝茅台，我要试试这所谓的威士忌是什么滋味。”卢西恩拒绝了波比给他倒酒，而是拿起了桌上那瓶威士忌。
en_us: "I'm not drinking Maotai, either. I want to try the taste of this whiskey." Lucien declined Bobby's drink, and instead picked up the bottle of whiskey on the table.

source: “我他妈……”鲍里斯当场就哭了。
en_us: "Damned..." Boris broke out into tears right on the spot.

source: “我们一直在追踪黑魔气，一路跟到了大皇子府邸，结果我们才刚刚翻墙进去，还没来得及查探，就被埋伏了。
en_us: "We had been tracing the evil aura, and traced it all the way to the first prince's mansion. In the end, we were ambushed just after we climbed over the wall. We did not even have the time to investigate anything.

source: “我们也来帮忙吧，有什么需要我们帮忙的，您尽管说。”先前那位中年工作人员带着几位女性工作人员上前来，看着麦格说道。
en_us: The middle-aged staff member brought a few female staff members over, and said to Mag, "Let us help too. Feel free to tell us what you need."

source: “我们似乎做了一件足以记入史册的事情。”
en_us: "We seemed to have done something enough to be put in the books of history."

source: “我们刚刚准备睡觉，听到了这边不同寻常的声音，所以就过来看看。
en_us: "We were about to go to sleep when we heard something strange here so we've decided to come over to take a look.

source: “我们刚刚到厨房，有位好心的胖叔叔，已经把他们好吃的东西全部给我们吃过一遍了。”艾米往嘴里塞了一个油炸小丸子，摇摇头道：“所以我们可以回家吃。”
en_us: "We went to the kitchen earlier and a kind fat uncle had already let us eat all their best food." Amy popped one little fried ball in her mouth and shake her head. "So, we can go home for our meals?"

source: “我们去的话，坏蛋是挺危险的。”艾米点点头道。
en_us: "It's really dangerous for the bad guys if we go there." Amy nodded and said.

source: “我们吃过早餐了，昨天晚上你还剩下不少绿豆糕，冰箱里也有牛奶。”艾米摸了摸肚子：“不过现在又饿了呢。”
en_us: "We already had breakfast. You left quite a bit of mung bean cake from last night, and there is milk in the fridge." Amy patted her tummy. "But, I am hungry again."

source: “我们已经做了该做的事情，现在的局势已经不是我们能够左右的，只能看各族博弈最后能够得到怎样的结果，至少目前的局势和前景都不是最糟糕的。”伊恩微笑着说道。
en_us: "We have done what we should. The situation now is not what we can control. We have to see what comes out of the fight among the races. At least the situation and outlook currently are not the worst," Ian said with a smile.

source: “我们应该庆幸哈迪斯先生带来的是茅台，不然我们在台上打自己脸的样子实在不太好看。”弗格斯笑着道。
en_us: "We should be be glad that Mr. Hades brought Maotai, otherwise it won't look when we contradict ourselves on stage." Fergus chuckled.

source: “我们应该把乔的尸体收回来，他是那样善良。当年要不是为了救战友，他的腿也不会断，更不应该在这里采一百年的花露，最后还被自己的族人吊死在栏杆上。”
en_us: "We should take Joe's body back. He was so kind. If not to save his comrade back then, he would not have broken his leg and would not have been picking dew here for a century and end up being hung dead on the pole by his own people."

source: “我们必须马上离开了，等到他真正对我们出手的时候，就无法离开了。”梅兰特用鬼刀斩杀了几个隐身出现在他们身后的古尸，沉声道。
en_us: Merante used his ghost sabre to slash the ancient corpses that appeared behind them stealthily and said in a low voice, "We have to leave right now. We won't be able to leave if he really starts to attack us."

source: “我们早上不会真的要吃这个吧？”伊琳娜小声在麦格耳边道。
en_us: "Are we really going to eat this early in the morning?" Irina whispered at Mag's ear.

source: “我们是邻居啊，就住在对面，这大半夜的哐哐哐响，我们就来看看，埃菲小姐是请了施工队来换门和清理地窖吗？”麦格笑呵呵道。
en_us: "We are the neighbors. We lived right across the street. We came to check because there is knocking sounds in the middle of the night. Did Miss Eiffie get the construction team to change the door and clean up the cellar?" Mag answered with a chuckle.

source: “我们最好退后一些，趁这个机会绕过飓风。”梅兰特并未表现的太过乐观，而是和紫纹狮鹫说道。
en_us: Merante didn't behave too optimisitc, instead he said to the purple-striped griffin, "We'd better back up a little and take this chance to go through the hurricanes."

source: “我们有租赁中介业务的，如果是哈迪斯先生的话，我还可以给您打了个折，只收5个点的年租金作为中介费用。”费奇点头。
en_us: "We do provide renting services. If you wish, I can give you a discount. I will only take the annual rental fees of five location as the agent fees." Fitch nodded.

source: “我们没有强者留守，无法抵抗他们的铁骑……”一位负伤的兽人酋长小声道。
en_us: "We did not have powerhouses to guard the place, so we were unable to resist their cavalry…" an injured orc chief said softly.

source: “我们现在要去一趟霍克部落。”雷克斯看着康妮说道。
en_us: "We need to go to the Hulk Tribe now," Rex told Connie.

source: “我们的勇敢的佣兵，完成了什么任务呢？”一道沙哑的声音从空洞后方传来。
en_us: "Brave mercenary. What mission have you completed?" came a hoarse voice from behind the wall.

source: “我们自由了！”
en_us: "We're free!"

source: “我们要从这里离开，地势不利于我们。”伊琳娜扬起法师杖，声光照耀，扑到面前的古尸顿时灰飞烟灭。
en_us: "We need to leave here. The terrain is disadvantageous to us." Irina raised her magic caster's staff and the Holy Light burst out. The ancient corpses that rushed towards them were decimated.

source: “我们要复仇！”
en_us: "We want revenge!"

source: “我们要科学酿酒，凭经验来这种想法已经落伍了，只有按照科学的方法酿酒，保证每一个步骤的规范性，我们才能保证每一瓶出厂的酒都有着同样优秀的品质，这就是所谓的品控。这些天我已经研究出了三套不同口感的朗姆酒的酿造配方……”刚走到酿造车间门外，麦格便听到了汉娜的声音从里边传来。
en_us: "We need to brew alcohol scientifically. It's already outdated to brew alcohol based on experience. Only by brewing according to the scientific methods can we ensure that every single step is standardized, and every bottle that leaves the brewery is equally excellent. This is the so-called quality control. I have already come up with three different formulae for three types of rum with different textures…" Mag heard Hannah's voice as soon as he reached the brewery's workshop.

source: “我们起了个头，这场戏就自己唱下去了，效果倒是比我们预想的还要更好一些。”伊琳娜看着麦格手里的信，也是微笑着说道。
en_us: Irina looked at the letter in Mag's hands with a smile, and said, "We simply start the ball rolling, and it just continues to roll by itself. Its effect is much better than what we have anticipated."

source: “我们运气不错，跑了出来。”麦格丢了两个水壶给他们，“不过运气也不太好，克苏鲁控制了冰原上的古尸，实力暴增，随时可能南下入侵，我们得在他行动之前建立起一个阻击联盟。”
en_us: "Our luck is not bad. We escaped." Mag tossed two water bottles to them. "But it isn't too good either. Cthulhu has controlled the ancient corpses in the snow field. Its power has growed exponentially. They may invade the south at any time. We have to establish a resistance alliance before it acts."
